Revit 2027 API
XYZ.IsAlmostEqualTo(XYZ, Double) Method
Determines whether 2 vectors are the same within the given tolerance.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool IsAlmostEqualTo(
	XYZ source,
	double tolerance
)
Public Function IsAlmostEqualTo (
	source As XYZ,
	tolerance As Double
) As Boolean
public:
bool IsAlmostEqualTo(
	XYZ^ source,
	double tolerance
)
member IsAlmostEqualTo :
        source : XYZ *
        tolerance : float -> bool
Parameters
source XYZ
The vector to compare with this vector.
tolerance Double
The tolerance for equality check.
Return Value
Boolean
True if the vectors are the same; otherwise, false.
Exceptions
Exception | Condition
ArgumentNullException |  Thrown when source is null.
ArgumentException |  Thrown when tolerance is less than 0.
Remarks
This routine uses an input tolerance to compare two vectors to see if they are almost equivalent. Because it is comparing two vectors the tolerance value is not in length units but instead represents the variation in direction between the vectors. For very small tolerance values it should also be possible to compare two points with this method. To compute the distance between two points for a comparison with a larger allowable difference, use DistanceTo(XYZ).
See Also
Reference
XYZ Class
IsAlmostEqualTo Overload
Autodesk.Revit.DB Namespace